感谢：https://github.com/OliverLew/PAT/blob/master/PATAdvanced/1003.c

给定一无向图，包含边权与点权，找到某两点间（边权）最短路径的条数，并且输出所有最短路径中点权和最大值。 
输入示例：
       5 6 0 2      顶点个数、边个数、起始点编号、终点编号
       1 2 1 5 3    各顶点权
       0 1 1        边连接的两顶点编号、边的权值，每行代表一条边
       0 2 2
       0 3 1
       1 2 1
       2 4 1
       3 4 1
输出示例：
       2 4          最短路径条数 最短路径中点权和最大值     

思路：
  修改图的存储结构与dijiastra算法，记录起点到当前节点最短路径条数。

代码结构：
  一、创建图的邻接矩阵存储数据结构，节点中增加npath、totalrescue以记录给定起点到该点的最短路径条数与最短路径上点权和最大值。
  二、Read() -- 根据输入建立图。
  三、ModifiedDijiastra(Graph G) -- 修改后的dijiastra，以求最短路径条数，修改后的dijiastra不记录路径上点的顺序。

---------------------------------------------代码部分-----------------------------------------------------

#include<stdio.h>
#include<stdlib.h>
#include<limits.h>  //各基本数据结构的边界值

#define INF INT_MAX
